architecture.org
#+PROPERTY: header-args :engine postgresql
#+PROPERTY: header-args :exports code
#+PROPERTY: header-args :tangle yes
#+STARTUP: content
* Introduction
:PROPERTIES:
:VISIBILITY: folded
:END:
** This file
This is the data definition and architecture expressed in POSTGRESQL
for Bootstrap facilitated training events and participant
tracking. This is a literate file written in Orgmode and tangled using
org-babel.
*** What am I doing?
** Bootstrap

Bootstrap develops curriculum and facilitates training for professional
educators and the organizations that support. Bootstrap delivers
pedagogical strategies to participant educators through in-person or
virtual learning sessions. Bootstrap seeks to support teacher from
novice learners until they can confidently implement Bootstrap
curriculum in their classrooms.

** Products and Services
Bootstrap develops curriculum for k-12 classrooms and trains teachers
to use it with their students. Bootstrap trainings prepare teachers to
deliver the curriculum such that their students can demonstrate
certain skills.

Bootstrap has some activities that can be accessed by the student
directly. However, the primary market for Bootstrap products and
services is the teacher student classroom where one teacher will
typically work with a groups of fifteen to thirty students.

Classrooms vary widely across the United States, and if we consider
international usage, there are many possibilities for the classroom
conditions in which Bootstrap curriculum may be deployed. To capture
some of this variety we look at classroom size, location, subject,
grade level, school schedule model (annual, semeseter, trimester,
block, etc.), student socioeconomic and race/ethnicity demographics,
teacher license and background, admin support, mandate vs teacher
choice, stipend received?, pre post student, pre post teacher,
deployment model (asynchronous, cherry picked, end-to-end, etc.).

Training participants are most often teachers, but are also teacher
assistants and para professional on the one hand and teacher
supervisors, administrators, and coaches on the other. We also note
the attendance of participants and observers who do not interact with
classrooms in their daily work, but are otherwise connect to Bootstrap.

The Bootstrap data model collects data for improving the curriculum, track
student academic achievement, and analyzing the relationship between changes to
curriculum, training, and on-going teacher supports. Over time the trainings and
curriculum becomes better suited to the needs of teachers and student
achievement. 

** Goals

This data models primary goal is to track and analyze the efficacy of
learning supports created by Bootstrap: curriculum materials and
facilitated trainings events.  Bootstrap hopes to continually improve
the learning model for professional educators. Support for educators
are successful if the educator feels confident enough to actually
bring a set of Bootstrap lessons into their classrooms. Bootstrap
further measures success through the achievement of students who
received Bootstrap curriculum.

** Non-goals

** Reporting Needs

** Analysis
*** Appropriateness (Fitness) of Training to Participant
- Participant computing background vs implementation
- Participant subject/license vs implementation
- Which facilitation techniques are most effective?
- Which training formats are most appropriate for which participants?
- How do we track the impact of non-teacher participants? Coaches who may be training others, should we attempt to get those names?
- How does years of teaching experience affect implementation after training?
- Which interventions have led to training more teachers to reach more students?
- Which curriculum is most effective at training teachers to implement? 
*** Confidence, Implementation, Growth
*** Students
- How many students are we reaching?
  - How accurate can we get this number?
  - How can we define a range of students reached?
  - Can we define an error within which we know a student is reached?
  - How many students are we reaching per lesson?
*** Correlation Questions
**** Curriculum Change vs Teacher Confidence
Curriculum changes aim to increase efficacy of lesson materials. More teachers would be able to navigate more quickly and more lessons would be delivered to more students.
- Has a given curriculum change increased the efficacy of the lesson materials in a measurable way?
- Training Change vs Confidence
- Facilitator or Event vs Confidence
*** Factors toward implementation
In the United States teachers are the primary driver of what lessons
get taught in their classrooms. However, a wide range of mandates of a
variety of strengths and types are placed upon teachers as they make
curricular decisions.  Teachers using Bootstrap curriculum in their
classroom are influenced by many factors. In some cases teachers are
required to teach certain lessons. In other cases teachers are
choosing to use Bootstrap lessons, who otherwise are not required.
Using Bootstrap can be seen on a teacher-choice spectrum. We seek to
know as much about the motivations behind teachers bringing Bootstrap
into their classrooms as possible.  Other factors affecting teachers
bringing Bootstrap into the classroom include:
- influence of colleagues
- desire to learn or grow themselves
- desire to increase student motivation
- 
