architecture.org
**** Compelled Implementation
Teachers may have mandates that compell them to use a certain
curriculum. Mandates placed on teachers vary in strength, how much of
the teacher's work is prescribed and type, which aspects of the
teacher's work are constrained. These mandates include:
- textbook requirements
- online learning platform and gradebook requirements
- technology or computer science requirements (these may include a number of hours or certain standards)
- or, full curriculum mandates
**** Free choice implementation
Some teachers have a great deal of freedom in what or how they teach,
while others have only some freedom of choice.  Certain subject areas
are more prescribed than others.  Standardized testing has a large
impact on teacher freedom even when the teacher is not under a direct
mandate. The phrase "teaching to the test" describes the common
phenomenon of modeling curriculum based on the end of the year
examinations. Curriculum that does not look like the exam is less
likely to be used. This phenomenon is more likely to be found where
student achievement on the exam is not as predictably guaranteed.
** Reporting
Bootstrap partners are in the business of supporting student
learning. Additionally partners may have special interest in a particular
student grouping.

Partners may employ teachers and run schools or they may be an organization or
foundation that is interested in education, technology, equity, or other special
interest that overlaps with Bootstrap products and service

Partners are interested in how well the curriculum supports student
achievement. Bootstrap's niche is supporting student learning in traditional
core subjects such as Algebra.

*** Attendance Reports
- Cohort attendance, sent to cohort admins (unified by contract)
- 
*** Pre Post Diagnostic Results Analysis
- teacher/participant pre/post from trainings
- aggregated classroom pre/post on Bootstrap diagnostics
- pre/post diagnostics from classroom final exam
*** Implementation Reports
*** Standardized Achievement
Are students achieving higher outcomes on standardized exams that they would already be required to take?
Some teachers administer their own diagnostics, and this practice is increasingly more common in administrative mandates.
** Definitions
*** End Users
**** Curriculum End User
The end users of Bootstrap curriculum are students, who will be using tools like
the Pyret or CODAP to build projects.

**** Training End User
The end users of Bootsrap trainings are
teachers. In most cases the person in the chair is
a teacher, who will bring the training, pedagogy,
and curriculum back to students in their
classroom.

Sometimes the person in the chair works alongside teachers and will take the
learning from Bootstrap back to their teachers in their own professional
enrichment setting.

*** Teacher and Student
Teachers spend the majority of their professional
time interacting with students.

Bootstrap interacts with partners who develop or
support teacher excellence through continued
education or "professional development" for
teachers. Partners include districts, non-profit,
private foundations, corporations, states, and
schools. Individual teachers also join open
enrollment events and may be paying out of pocket.

Teachers often receive some form of compensation
from their school, district, or supporting
organization.

Partners often request reports, especially
attendance, which they use to track participant
participation and to validate stipends. The
partner may or may not have requirements for the
form of the report.

Professional educators are often teachers or have
had experience in the classroom, but can also be
administrators, paraprofessionals, learning
coaches, or department coordinators. We wish to
track the changing role our teachers have to their
profession and employer. We wish to know a
teachers current schedule and where in that
schedule they have been able to utilize Bootstrap
curricula or pedagogy.

Teachers have the largest and most direct role in
affecting student outcomes and the quality of the
Bootstrap implementation.

Bootstraps primary aim is to support student
learning in core academic skills, especially
mathematical reasoning. Teachers are the
professionals who deploy Bootstrap content. The
quality of that deployment directly correlates to
student achievement with Bootstrap.  Whether
Bootstrap curricula meets its aim to boost
standardized achievement relies on the quality of
teacher's deployment.

Administrators oversee teachers. They are the
point persons on the contracts the create training
events and build cohorts. Administrators track
teacher attendance at training events and may
disperse stipends to teachers based on
deliverables.

Implementation describes a teacher using Bootstrap
curriculum with their students. Bootstrap
curriculum is designed to fit in as a module into
existing classes with established goals. Teachers
using Bootstrap in their classes have identified a
learning goal or series of goals that Bootstrap
curriculum covers. Depending on the course
objectives and grade band of students different
swaths of curriculum are available. Implementation
is a description of the context in which a teacher
is using Boostrap, to what depth and what breadth.

Student achievement measures show gains through
pre and post diagnostics of skills covered by the
Bootstrap curriculum. These skills overlap between
Bootstrap curriculum, but have different contexts
that they support. Student learning requires both
high quality curriculum and high quality
deployment by the teacher.

Teacher learning ...

*** Admin
Within a Bootstrap contract the point persons for the partner
organization are the admins of the contracted event. Admins receive
reporting and communication about their cohort.
*** Cohort
A cohort is a group of teachers supported by a particular
contract. Cohorts begin with a training event and a certain date. 
*** Facilitator, Master Teacher, and Master Teacher in Training
Training events are facilitated by Bootstrap Master Teachers. A
facilitator is the primary point person for training participants
during and immediately after the training event.
*** Coach
A coach is a Bootstrap Master teacher supporting groups of teachers
through short regular sessions. These sessions are largely driven by
the questions and needs of teachers in the process of using Bootstrap
curriculum in their classrooms.
*** Professional Development
A training event that covers an entire curriculum is considered
professional development. Participants in professional development
events are trained as both student and teacher. They must understand
the curriculum and the pedagogy behind key point in the curriculum.
*** Participant Life Cycle
- Intake
- Onboarding
- Training
- Implementation with Support
- Solo Implementation
- Master Teacher in Training
- Master Teacher

*** Teacher
has a role within their organization that places them in front
of students for the majority of their day.

Administrators have a role to their organization that places them
supporting teachers for the majority of their day.

These relationships to the outside organization are orthogonal to the
relationships to Bootstrap trainings. However, the relationship to the
outside organization affects how the 

This data model seeks to capture the changing roles educators have to their external
organizations and to their students.  and how that affects their relationship
with us.

Things to change about the curriculum.

Things to change about training.

Things to change about on-going support.

Quality assurance 
