architecture.org
*** Partners
Reports for partners include
- a teacher level attendance report
- a teacher level proficiency report
- cohort aggregations
- implementation reports
*** Internal analysis
- Interventions over time
- Teacher retention
- Types of facilitation experience vs implementation
- Teaching context vs implementation
  
** Grain
The grain in our data model is the professional educator. We measure the
efficacy of the training experience as it relates to various factors in the life
of a professional educator. We collect reactions to our trainings and followup
for a period of time as the teacher attempts to bring Bootstrap curriculum into
the classroom. Pre and post test student data stops at the teacher level. We do
not track students as entities or store any individual student data.
** Dimensions
*** Dimension Hierarchy
- Contact
  - User #subset, rather than child
    - Enrollment
- Curriculum
  - Skills
- Partner
  - Contract
- Cohort
  - Participant
- Event
  - User
  - Enrollments
    - Role
      - Facilitator
      - Participant
      - Admin
      - Master teacher in training
      - Ambassador #not really an enrollment role
- States
  - Districts
    - Schools
      - Classes
	- Teachers
	  - Implementations

*** Dimension Tables and Attributes
- Contact
  - id
  - name
  - email
  - phone
  - where from?
  - opt in list #how/where to track email opt-in?
- User
  - contact_id
  - date_added
- Partner Org #could this be a district?
  - id
  - Name
  - Type ('non-profit', 'government', 'private')
  - Admins
- School
  - school_id
  - Name
  - Location #what is location?
  - Grade band (e.g. '9-12')
  - Demographic #what is demographic?
  - District REFERENCES ("District") "district_id"
  - Address #what is an address 
- District #this is a school umbrella or support organization
  - district_id
  - State
- Facilitator
- Contract
- Event
- Year
- Curriculum (Data Science, Data Science CODAP, Early Math, Algebra, Algebra 2)
- Learning Model #what is a learning model
- Skill #breaking down Bootstrap curriculum to the skill level. this
  is our product.
- Location
  - Street Address
  - City
  - State
  - Zipcode
  - Country
- Demographic
  - race ('American Indian or Alaska Native', 'Asian', 'Black or African American', 'Native Hawaiian or Other Pacific Islander', 'White' )
  - ethnicity ('Hispanic or Latino', 'Not Hispanic or Latino')
  - grade_band
  - setting ('urban', 'rural', 'suburban')
  - socio-economic status
- Type
- Certification
  - teacher_id
  - state
  - subject
  - grade_band
  - type #what is this?
- Class
  - teacher_id
  - subject
  - student_demographics #what is this?
  - start_date
  - end_date
- Role
  - teacher_id
  - school_id
  - role ('teacher', 'paraprofessional', 'supervisor', 'coach',
    'coordinator')
  - start date
  - end date
- Coaching
- Stipend
- Partner report request
- Admin support #capture the relationship between
  this teacher and the surrounding professional
  environment
- Student achievement
- Subject
- Course
- Standard

*** Explanation
All (most) schools have districts or other support organizations.  Partner
organizations build contracts with Bootstrap to train cohorts of educators. A
partner organization could also be a district and referenced with a foreign key.

** Measures
- Implementation
- Attendance
- Interaction
- Workbooks
- Assessment
- Pathway
** Facts
- Implementation
  - Start Data
  - End Data
  - Class
- Class
  - School
  - # Students
  - Demographics
  - Grade Level
  - Course Name
  - Subject
  - Level
- School
  - Name
  - District/Org
  - Student Age or Grade Range
  - City
  - State
  - Address
  - Principal
  - Website
  - Gradebook/LMS Software
  - Tech Affiliation, Google, MSFT, etc.
  - CS Affiliation, Code.org, PLTW, etc.
- District
  - Name
  - State
  - Serving Zip Codes
  - Website
    
- Feedbacks
  - Confidence
  - Appropriateness
- Event Cohorts
  - event_id
  - teacher_id
- Year Cohorts
- Comments
  - teacher_id
  - commenter_id
  - comment
  - date
  - time
  - tags
  - refer_to
- Attendances
  - teacher_id
  - event_id
  - attendance_value
  - attenadance_date
  - attendance_period
- Assessments
  - teacher_id
  - title
  - context
  - cohort_id
  - skill
  - evidence
  - rating
  - rater
  - date
    
** Core Entity (Primary Dimension) Tables
** Introduction
These tables are descriptive data elements that make up the relationships in our
system. They represent everything we know about the people, organizations, and
events in our facilitation ecosystem.
** Contacts
Anyone who has interacted with Bootstrap, who ever
signed up for an event, even if they did not
attend. Anyone who joined the mailing list through
a web form, reached out directly to Bootstrap
staff, messaged through social media, requested
answer keys, or joined Discourse.

#+begin_src sql
  CREATE TABLE contacts ( ContactID varchar(255), NameFirst
    varchar(255), NameLast varchar(255), AltNameFirst varchar(255),
    AltNameLast varchar(255), emailPersonal varchar(255),
    emailProfessional varchar(255) );

#+end_src

** Users
All of the individual persons who make up the
Bootstrap event facilitation ecosystem. Users are
required to submit a full personal and
professional questionaire.

#+begin_src sql
  CREATE TABLE users ( userID varchar(255), contactID varchar(255)
    REFERENCES contacts (contactID), lastName varchar(255), firstName
    varchar(255), userAddress varchar(255), userCity varchar(255),
    userState varchar(255), homePhone varchar(15), cellPhone
    varchar(15), workPhone varchar(15), gender varchar(255) REFERENCES
    gender (genderID), race varchar(255) REFERENCES race (raceID) );

#+end_src
** Events
Bootstrap facilitates events for professional educators. These events focus on
the conceptual understanding and implementation of Bootstrap curriculum.

#+begin_src sql
  CREATE TABLE "events" ( "event_id" varchar(255), eventName
    varchar(255), eventDays int CONSTRAINT positive_days CHECK
    (eventDays > 0),
    --length in days eventType varchar(255) REFERENCES eventTypes
    (typeID), eventFormat varchar(255) REFERENCES eventFormats
    (formatID), );

#+end_src

** Organizations
Bootstrap partners with external organizations to build contracts
for facilitated events. Organizations can be municipal or state
level education districts, non-profits, individual schools, private
individuals, or Bootstrap itself.
- State
- Main Email
- Type

#+begin_src sql
  --Main Tables Users, Organizations, Events CREATE TABLE organizations
  ( orgID varchar(255), orgAddress varchar(255), orgCity varchar(255),
  orgState varchar(255) );

#+end_src

** Assessment Instruments

#+begin_src sql
  CREATE TABLE assessments ( assessmentID varchar(255) );

#+end_src

** Feedback Instruments
** Intake Instruments
** Attribute (Derived) Tables
** Locations
** Licenses
** Schools
** Districts
** Roles
** Textbooks

#+begin_src sql
  CREATE TABLE Textbooks ( textBookID varchar(255), textBookName
    varchar(255), textBookPublisher varchar(255) );

#+end_src

** TODO Communication Preferences (Opt In/Out)
** Relationship (Fact) Tables

