architecture.org
** Internal and external roles

People have different relationships to our facilitated events. Current roles
relative to events are Facilitator, Participant, Admin, and Master Teacher in
Training.

** User-Event Roles (Enrollments)
#+begin_src sql

  --Relationship Tables

  CREATE TABLE enrollments ( enrollmentID varchar(255), userID
    varchar(255) REFERENCES Users (UserID) );
#+end_src
** User-Organization Roles (OrgRoles)

#+begin_src sql
  CREATE TABLE orgRoles ( userID varchar(255) REFERENCES users (UserID),
    orgID varchar(255) REFERENCES organizations (OrgID), roleID
    varchar(255) REFERENCES roles (RoleID)

  CREATE TABLE Enrollments ( EnrollmentID varchar(255), UserID
    varchar(255) REFERENCES Users (UserID) );
#+end_src

** User-Organization Roles (UserOrganizationRoles)

#+begin_src sql
  CREATE TABLE UserOrganizationRoles ( UserID varchar(255) REFERENCES
    Users (UserID), OrgID varchar(255) REFERENCES Organizations (OrgID),
    RoleID varchar(255) REFERNCES Roles (RoleID)

  );

#+end_src

** Comments

#+begin_src sql

  CREATE TABLE comments ( authorUserID varchar(255), regardingUserID
    varchar(255), commentDate varchar(255), tagUserID varchar(255),
    commentType varchar(255)

  );

#+end_src



** User-Event-Attendance (Attendance)

#+begin_src sql

  CREATE TABLE attendance ( serID varchar(255), eventID varchar(255),
    attendanceDate Date, attendancePeriod varchar(255), attendanceValue
    varchar(255)

  );

#+end_src

** Contracts

Organizations and individual create contracts with
Bootsrap that lead to the create

#+begin_src sql
  CREATE TABLE Contracts ( ContractID varchar(255), OrgID varchar(255)
    REFERENCES Organizations (OrgID), EventID varchar(255) REFERENCES
    Events (EventID) );

#+end_src

** Coaching

Coaching is included in some contracts. The
coaching table is a postive entry table. Users
present in the coaching table are invited to
coaching sessions throughout the year. Enrollment
in coaching is for one year and is specific to a
curriculum. Usually you are assigned coaching for
the curriculum in which you were trained in the
same calendar year.

#+begin_src sql
  CREATE TABLE Coaching ( -- Coaching is a postive entry table. A user
  found in this table has -- coaching included in their contract );

#+end_src

** Assessment Instrument Data

#+begin_src sql

  CREATE TABLE instrumentData ( instrumentDataID varchar(255), userID
    varchar(255) REFERENCES Users (userID), submitted varchar(255)
    timestamp with time zone, instrumentData text );

#+end_src
** Custom Data Types

I'm still working out which helper collections are ENUMs.

types and which we add to a helper table. My intuition is that there are short
sets that we know already and that aren't likely to change, such as race, and
there are longer sets like the textbooks that might continue to grow.

** Enrollment Roles
These are the roles with respect to our enrollment relationship. They answer the
question what are you doing as part of this event. This list could grow as the
type and complexity of event planning changes.

Some rules attached to these roles. For example, perhaps a participant cannot be
enrolled to an event before a facilitator has first been enrolled.

#+begin_src sql
  CREATE TYPE "enrollment_roles" AS ENUM ('facilitator', 'participant',
  'admin', 'master teacher in training' );
#+end_src

** Race and Ethnicity

#+begin_src sql
  CREATE TYPE race AS ENUM ('American Indian or Alaska Native', 'Asian',
  'Black or African American', 'Native Hawaiian or Other Pacific
  Islander', 'White' );

  CREATE TYPE ethnicity AS ENUM ('Hispanic or Latino', 'Not Hispanic or
  Latino' );
#+end_src

** Gender

#+begin_src sql
  CREATE TYPE gender AS ENUM ('Male', 'Female', 'Transgender', 'None of
  these');
#+end_src

** License

#+begin_src sql
  CREATE TYPE license AS ENUM ('Math', 'Science', 'Social Studies',
  'English', 'Language other than English', 'Elementary General Ed',
  'Special Education');

  CREATE TABLE license ( userID varchar(255) REFERENCES users (userID),
    license varchar(255), licenseState varchar(255) );

#+end_src

** Organization Types

*** TODO What are the organization types we interact with?
Is this redundant from Insightly?
#+begin_src sql
  CREATE TYPE orgTypes AS ENUM ('Non-profit', 'For-profit', 'School',
  'District', 'State Government Office', 'Foundation');

#+end_src

** Subjects Taught

#+begin_src sql
  CREATE TYPE subjectsTaught AS ENUM ('AP', 'Algebra', 'Geometry',
  'Biology' );

#+end_src

** Grades Taught

#+begin_src sql

  CREATE TYPE "grades_taught" AS ENUM ('1st', '2nd', '3rd', '4th',
  '5th', '6th', '7th', '8th', '9th', '10th', '11th', '12th');

#+end_src

** Event Formats

#+begin_src sql

  CREATE TYPE "event_formats" AS ENUM ('Intensive', 'Distributed',
  'One-day', '2-hour' );

#+end_src

** Event Types

#+begin_src sql
  CREATE TYPE eventTypes AS ENUM ('Full PD', 'Intro PD', 'Coaching',
  'Academic Year Workshop' );

#+end_src

** Curricula

#+begin_src sql
  CREATE TYPE curricula AS ENUM ('Algebra', 'Data Science', 'Physics',
  'Algebra 2', 'Early Math', 'Data Science (CODAP)' );

#+end_src

* Data Model
* The Teacher Journey
** The Bootstrap Participant Landscape
Professional educators find themselves in a Bootsrap training from a
variety of pathways. Typically, partner organizations build training
contracts for cohorts of teachers, which leads to participants with a
range of motivations and prior knowledge.

Bootstrap curriculum is freely available on the internet. Teachers
attend trainings (and have done so for many years), and those who have
been trained contiue to expose others. Teachers who attend Bootstrap
trainings generally love their experience, hence word of mouth brings
teachers in.
**** TODO Add data table for how you connect to bootstrap
This is to distinguish from the teacher added by an administrator without intrinsic interest

** The Timespan of a Teacher Journey

How long does a teacher receive support and monitoring? Educators can
attend multiple workshops. Does the clock reset? Do we track cohort
contracts, which may have different time lengths for continued
support? Do we continue to assess teaching confidence and strength of
implementation and offer support as long as the teacher is using
Bootstrap curricula? What is the average or typical journey? Are their
logical subsets that may have different typical journeys?

Analysis of our current implementers will help. We have responses to the
implementation survey. We have attendance at coaching and we have on-going
contact. In the future we hope to have users log into a website where we can
track lesson plan usage and custom pathways.

** Milestones
*** Year 1
*** Year 2
*** Year 3
** Communication Plan
*** First Contact
First contact can be casual or formal. Casual contacts include requests for
information through web forms, posting or emailing questions, and tags on social
media. Formal contacts are typically enrolled in a workshop; the first they hear
from us would be a formal welcome to a training event with logistic information.

*** Contacts
Contact data allows us to send a message with a
general idea of who the person is. At minimum a
first contact is an email address, a first and
last name, a job title, and a what brings you
here.
#+begin_src sql
      CREATE TABLE IF NOT EXISTS "contacts" ( "id" SERIAL PRIMARY KEY,

  );
#+end_src
