architecture.org
*** Preworkshop Intake Data
Information prior to enrolling in a full training scenario is used to
ensure the training is appropriate for the participant, the
training addresses participant needs, and . So, what do we want or need to know
about our teachers?

We want to know how to contact them. We want to know two email
addresses for each person: their school or organization based address
and a personal or persistent address that would not change if they
left their current position. Teachers may change schools, but they
remain Bootstrap teachers.

We want to know about their training and prior
experience. Professional educators typically hold certification and
licensure. Their state has typically granted and certification and
their municipallity has licensed them to teach in the district. A
teacher could work at an independent school and have no certification
or licensure. A teacher could be instructing classes within their
licensed area or outside of it.

We want to know about the classes they are currently teaching and the classes
they plan to teach next year. We want to know the subject and grade level of
those classes, which may be different for each class. Hence, we actually want a
siimplified class program for each of our participants.

*** Intake data
**** Teacher program
#+begin_src sql
  -- a class in a teachers program tells us the subject and grade level
  where the teacher will be interacticng with students CREATE TABLE IF
  NOT EXISTS "classes" ( "teacher_id" , "class_id" PRIMARY KEY,
  "class_name" , "class_subject" SUBJECT, "class_gradelevel" GRADELEVEL,
  "class_start_date" DATE, "class_end_date" DATE, CONSTRAINT
  "fk_teacher" FOREIGN KEY ("teacher_id") REFERENCES "users" ("user_id")
  );
#+end_src

#+begin_src sql
  CREATE TABLE IF NOT EXISTS "certification" ( -- tracks the
  certifications relative to state wide professional educators
  "teacher_id" varchar(255), "cert_id" varchar(255), "state_ab"
  varchar(2), "title" varchar(255), "subject" varchar(255), CONTSTRAINT
  "fk_teacher" FOREIGN KEY ("teacher_id") REFERENCES "users" ("user_id")
  );

#+end_src
** On-going Support and Monitoring
** The Journey to Master Teacher

